{
  "main": {
    "name": "Jason",
    "occupation": "Software Engineer",
    "description": "",
    "image": "profilepic.jpg",
    "bio": "I'm a dedicated Software Engineer based in Vancouver, Canada, currently pursuing a B.Sc. in Computer Science at Simon Fraser University. Having worked on crucial fintech products, I’m accustomed to architecting and implementing complex solutions for critical systems that impact a large user base. I am eager to explore new graduate opportunities, not limited to my previous experience, where I can leverage my technical skills and contribute to innovative software solutions. I thrive in collaborative environments and am committed to continuous learning and growth in the ever-evolving tech landscape. Download my resume for more information!",
    "contactmessage": "Contact me with any inquiries.",
    "email": "jason_gill15@hotmail.com",
    "address": {
      "city": "Vancouver",
      "state": "BC"
    },
    "website": "http://www.jason.com",
    "resumedownload": "/JasonGill/#header",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/jason-gill-88321522a/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/xgill15x",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I'm familiar with a wide variety of technologies",
    "work": [
      {
        "school": "Clio",
        "degree": "Software Engineer Intern",
        "graduated": "Jan 2024 - Aug 2024",
        "description": "Streamlined transaction processing for over 50,000 law firms by developing a Payments component with integrated Stripe functionalities, effectively transitioning away from legacy payment infrastructure. My leadership in incident response efforts ensured transaction reliability for over $10 million CAD in daily processing volume, where I diagnosed and resolved critical issues promptly. Additionally, I achieved compliance with multi-regional financial regulations by refactoring payment flows to enhance security and align with industry standards"
      },
      {
        "school": "Ultimate Kronos Group",
        "degree": "Software Engineer Intern",
        "graduated": "May 2022 - Aug 2022",
        "description": "Led the Custom Branding project, utilizing Angular and Java Spring Boot to empower customers to personalize their product suite effectively. By enhancing the user interface with our in-house Design Language System (DLS) components, I successfully reduced page load times by 12.5%. I implemented state management using NgRx and developed scalable APIs through Spring RESTful services, ensuring a seamless experience for users. Additionally, I achieved over 85% code coverage by leveraging testing frameworks such as JUnit, Jasmine, and Selenium, ensuring robust application performance"
      }
    ],
    "education": [
      {
        "school": "Simon Fraser University",
        "degree": "Bachelors in Computing Science",
        "graduated": "Sep 2020 - May 2025",
        "description": "Relevant Coursework: Data Structures & Algorithms, Operating Systems, Database Systems, Data Science, Computer Networking, User Interface Design, Requirements Engineering"
      },
      {
        "school": "Tamanawis Secondary",
        "degree": "Graduated ",
        "graduated": "June 2020",
        "description": ""
      }
    ],
    "projects": [
      {
        "title": "Bijou Budget",
        "language": "ReactJS, Java Spring Boot, SQL",
        "link": "https://github.com/xgill15x/Budget-Tracker",
        "description": "Bijou Budget is an intuitive budget tracking application implemented using ReactJS, Java Spring Boot and mySQL. Deployed with Amazon Web Services, this website helps users keep track of their recurring expenses by allowing them to set monthly budgets and add transactions throughtout the month."
      },
      {
        "title": "Galactic Grease Monkey ",
        "language": "Java",
        "link": "https://github.com/xgill15x/GalacticGreaseMonkey",
        "description": "The first big team project I got to lead. An exciting 2D arcade game in which the user must navigate around black holes, aliens, and satellites to collect diamonds and spaceship parts to achieve high scores. We used the A* search algorithm to implement pathfinding, the Java Abstract Window Toolkit to render graphics, and the KeyListener interface to handle events."
      },
      {
        "title": "Computational Blockchain",
        "language": "Rust ",
        "link": "https://github.com/xgill15x/Computational-Blockchain",
        "description": "Developed a work-based blockchain application in Rust with the SHA256 hashing algorithm. The application implements a producer-consumer work queue that concurrently mines blocks by distributing the workload among multiple worker threads. It then retrieves the first eligible proof before draining the multi-threaded work queue, ensuring resource optimization."
      },
      {
        "title": "UFC Predictive Modelling",
        "language": "Python",
        "link": "https://github.com/xgill15x/UFC-Dataset-Analysis",
        "description": "Developed a machine learning model using the k-th nearest neighbor algorithm in Python with the Scikit-learn library, achieving a 70% accuracy rate in predicting fight winners. Additionally, I forecasted fighters' win-loss ratios by creating a supplementary machine learning model that attained a coefficient of determination (R²) of 0.96, demonstrating its high predictive power and effectiveness in analyzing fight outcomes"
      },
      {
        "title": "Weather & Traffic App ",
        "language": "Python ",
        "link": "https://github.com/xgill15x/Weather-App",
        "description": "Hosted on PythonAnywhere, this Python script uses the Twilio API to send daily SMS text suggestions to my phone purposed towards avoiding travelling inconvinience. It summarizes recent weather and traffic data for the route to my university. Weather information is retrieved via the OpenWeatherMap API and traffic time is determined through the TrueWay Directions API."
      },
      {
        "title": "Poker Game",
        "language": "Java & Python ",
        "link": "https://github.com/xgill15x/Poker-Game",
        "description": "Built a Java CLI poker game that recognizes all the unique poker hands, determines the winners of any game, and displays the player rankings accordingly. The project was designed with highly cohesive classes, validated with automated script testing in Python, and documented with Javadoc."
      },
      {
        "title": "My Personal Website ",
        "language": "ReactJS ",
        "link": "https://xgill15x.github.io/JasonGill",
        "description": "The website you are viewing was developed in ReactJS and deployed using Github Pages. The contact form makes use of the EmailJS library to increase engagement."
      }
    ]
  }
}
