{
  "main": {
    "name": "Jason",
    "occupation": "software developer",
    "description": "",
    "image": "profilepic.jpg",
    "bio": "I'm a 3rd year Computer Science student at Simon Fraser University. I'm currently searching for my second software development internship in 2023. I'm passionate about solving problems and love using programming applications to approach them. I look forward to gaining more experience in the various fields of the software industry to ensure I grow as a well-rounded developer. I have worked with a variety of tools such as Git, AWS (Elastic Beanstalk, CloudFront, S3, Relational Database Service, Route53, Amazon Certificate Manager), mySQL, JUnit, Maven, Postman, Figma and Balsamiq. I am familiar with Java (Spring Boot), C, C++, Python, JavaScript (ReactJS), Typescript(Angular), SQL, MATLAB, HTML, CSS and more.",
    "contactmessage": "Contact me with any inquiries.",
    "email": "jason_gill15@hotmail.com",
    "address": {
      "city": "Vancouver",
      "state": "BC"
    },
    "website": "http://www.jason.com",
    "resumedownload": "/JasonGill/#header",
    "social": [
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/jason-gill-88321522a/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/xgill15x",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I'm familiar with a wide variety of technologies",
    "work": [
      {
        "school": "Ultimate Kronos Group",
        "degree": "Software Engineer Intern",
        "graduated": "Sep 2020 - May 2024",
        "description": "Increased customer satisfaction by leading the custom branding project which included front-end development and API endpoint creation. Managed to decrease page load times by 12.5% by disposing of outdated UI components and replacing them with lightweight in-house Design Language System (DLS) alternatives. Improved the full-stack codebase integrity by achieving 100% class coverage and a minimum of 94% method coverage in all pull requests."
      }
    ],
    "education": [
      {
        "school": "Simon Fraser University",
        "degree": "Bachelors in Computing Science",
        "graduated": "Sep 2020 - May 2024",
        "description": ""
      },
      {
        "school": "Tamanawis Secondary",
        "degree": "Graduated ",
        "graduated": "June 2020",
        "description": ""
      }
    ],
    "projects": [
      {
        "title": "Bijou Budget",
        "language": "ReactJS & Java Spring Boot ",
        "link": "https://bijoubudget.be",
        "description": "Bijou Budget is an intuitive budget tracking application implemented using ReactJS, Java Spring Boot and mySQL. Deployed with basic authentication and with the help of AWS, this website helps users keep track of their recurring monthly expenses by allowing them to set a budget and add transactions throughtout the month."
      },
      {
        "title": "Galactic Grease Monkey ",
        "language": "Java ",
        "link": "https://github.com/xgill15x/GalacticGreaseMonkey",
        "description": "The first big team project I got to lead. An exciting 2D arcade game in which the user must navigate around black holes, aliens & satellites to collect diamonds and spaceship parts to achieve high scores."
      },
      {
        "title": "Three Card Poker",
        "language": "Java ",
        "link": "https://github.com/xgill15x/threeCardPoker",
        "description": "A CLI implementation of three card poker. Follow the link to the read me for an in-depth description of the rules and implementation."
      },
      {
        "title": "Weather & Traffic App ",
        "language": "Python ",
        "link": "https://github.com/xgill15x/WeatherApp",
        "description": "Hosted on PythonAnywhere, this script uses the Twilio API to send daily SMS text suggestions to my phone purposed towards avoiding travelling inconvinience. Summarizes recent weather and traffic data for the route to my university. Weather is retrieved via the OpenWeatherMap API and traffic time is determined through the TrueWay Directions API."
      },
      {
        "title": "My Personal Website ",
        "language": "ReactJS ",
        "link": "https://xgill15x.github.io/JasonGill",
        "description": "This current website you are viewing was developed in ReactJS and deployed using Github Pages. The contact form makes use of the EmailJS library to provide a seamless user experience."
      }
    ]
  }
}
